In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','prachi','ashu','neha'],
    "marks":[95,12,45,67],
    "city":['rampur','kolkata','bareilly','antartica']
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0   harry     95     rampur
1  prachi     12    kolkata
2    ashu     45   bareilly
3    neha     67  antartica

In [5]:
df.to_csv('friends.csv')  #create a excel sheet and put all dataframe in it

In [6]:
df.to_csv('friends.csv',index=False)  #remove index from excel sheet

In [7]:
df.head(2)  #starting rows

     name  marks     city
0   harry     95   rampur
1  prachi     12  kolkata

In [8]:
df.tail(2)  #last 2 rows

   name  marks       city
2  ashu     45   bareilly
3  neha     67  antartica

In [9]:
df.describe()  ## it will show mean,std,min,max,count of numeric column

           marks
count   4.000000
mean   54.750000
std    35.084422
min    12.000000
25%    36.750000
50%    56.000000
75%    74.000000
max    95.000000

In [10]:
prachi = pd.read_csv('prachi.csv')

In [11]:
prachi

   Unnamed: 0.1  Unnamed: 0  Train number  speed       city
0             0           0        123457     50     rampur
1             1           1         64643     12    kolkata
2             2           2         67436     45   bareilly
3             3           3         27854     67  antartica

In [12]:
prachi['speed']

0    50
1    12
2    45
3    67
Name: speed, dtype: int64

In [13]:
prachi['speed'][0]

50

In [14]:
prachi['speed'][0]= 50

C:\Users\Rohit\AppData\Local\Temp\ipykernel_16864\1370337462.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  prachi['speed'][0]= 50

In [15]:
prachi

   Unnamed: 0.1  Unnamed: 0  Train number  speed       city
0             0           0        123457     50     rampur
1             1           1         64643     12    kolkata
2             2           2         67436     45   bareilly
3             3           3         27854     67  antartica

In [16]:
prachi.to_csv('prachi.csv')

In [17]:
#index change
prachi.index = ['first','second','third','fourth']

In [18]:
prachi

        Unnamed: 0.1  Unnamed: 0  Train number  speed       city
first              0           0        123457     50     rampur
second             1           1         64643     12    kolkata
third              2           2         67436     45   bareilly
fourth             3           3         27854     67  antartica

In [19]:
# Pandas is an open source data analysis library written in python
# It leverages the power and speed of numpy to make data analysis an preprocessing easy for data scientists
# Pandas is fast and it has high performance & productivity for users.


#***Pandas generally provide two data structures for manipulating data, They are:*** 

# Series
# DataFrame

In [20]:
# series -  Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).
# Pandas Series is nothing but a column in an excel sheet. Labels need not be unique but must be a hashable type.

# datafrome - Pandas DataFrame is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). 
# A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

In [21]:
ser = pd.Series(),

C:\Users\Rohit\AppData\Local\Temp\ipykernel_16864\1490786981.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series(),

In [22]:
print(ser)

(Series([], dtype: float64),)

In [23]:
data = np.array(['h','e','r','u'])

In [24]:
ser = pd.Series(data)

In [25]:
print(ser)

0    h
1    e
2    r
3    u
dtype: object